I believe it has to do with the `description`, removing the description yields an AlreadyExists error.

```
bruno@pop-os ~/D/t/> terraform apply -auto-approve                                                                                                                                                                       (base) 
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/aws in /home/bruno/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.default will be created
  + resource "aws_cloudwatch_event_rule" "default" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + source = [
                  + "aws.sts",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "one"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.duplicate will be created
  + resource "aws_cloudwatch_event_rule" "duplicate" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + source = [
                  + "aws.sts",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "one"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_cloudwatch_event_rule.duplicate: Creating...
aws_cloudwatch_event_rule.default: Creating...
aws_cloudwatch_event_rule.default: Creation complete after 2s [id=one]
╷
│ Error: error creating EventBridge Rule (one): ConcurrentModificationException: com.amazon.aws.platform.tagris.client.exception.TagrisClientException: A resource with the same resourceName but a different internalId already exists: 675522a2-9f25-437b-2a12-5fe23b8b061d
│ 
│   with aws_cloudwatch_event_rule.duplicate,
│   on main.tf line 10, in resource "aws_cloudwatch_event_rule" "duplicate":
│   10: resource "aws_cloudwatch_event_rule" "duplicate" {
│ 
╵
bruno@pop-os ~/D/t/ [1]>          
```